#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with aws_s3_bucket.fm-terra-s3,
  on s3.tf line 1, in resource "aws_s3_bucket" "fm-terra-s3":
   1: resource "aws_s3_bucket" "fm-terra-s3" {

Use the aws_s3_bucket_versioning resource instead

(and one more similar warning elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.fm-terra-s3: Refreshing state... [id=fm-terra-s3]
aws_ssm_parameter.bard: Refreshing state... [id=bard1212]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.basic-dynamodb-table will be created
  + resource "aws_dynamodb_table" "basic-dynamodb-table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "UserId"
      + id               = (known after apply)
      + name             = "GameScores"
      + range_key        = "GameTitle"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "Name"        = "dynamodb-table-1"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "Name"        = "dynamodb-table-1"
        }
      + write_capacity   = 20

      + attribute {
          + name = "GameTitle"
          + type = "S"
        }
      + attribute {
          + name = "TopScore"
          + type = "N"
        }
      + attribute {
          + name = "UserId"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "GameTitle"
          + name               = "GameTitleIndex"
          + non_key_attributes = [
              + "UserId",
            ]
          + projection_type    = "INCLUDE"
          + range_key          = "TopScore"
          + read_capacity      = 10
          + write_capacity     = 10
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "TimeToExist"
          + enabled        = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.fm-terra-s3,
  on s3.tf line 1, in resource "aws_s3_bucket" "fm-terra-s3":
   1: resource "aws_s3_bucket" "fm-terra-s3" {

Use the aws_s3_bucket_versioning resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @fabiomaster01, Action: `pull_request`*